wisteria-1c/Конфигурация/Catalogs/ПравилаРасчетаПремийПоЛичнымПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПравилаРасчетаПремийПоЛичнымПродажам</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаПремий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаПремийПоЛичнымПродажам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеРасчетаПремий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоРасчетаПремий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоРасчетаПремий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияНачисленияПремий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияНачисленияПремийПоЛичнымПродажам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособыРасчетаПремийПоЛичнымПродажам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаПремийПоЛичнымПродажам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ПравилаРасчетаПремийПоЛичнымПродажам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзменитьВидимостьЭлементов();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Наименование = СформироватьАвтоНаименованиеНаСервере();
		Объект.ВалютаРасчета = Константы.ВалютаУчета.Получить();
	Иначе
		СформироватьАвтоНаименованиеНаСервере();
	КонецЕсли;
	
	Для каждого ВариантНаименования Из Элементы.Наименование.СписокВыбора Цикл
		Если Объект.Наименование = ВариантНаименования.Значение Тогда
			ИспользуетсяАвтоНаименование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ИнициализироватьТекстПодсказок();
	АдаптацияФормыТакси();
	АдаптацияМобильныйКлиент();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	НаименованиеИзмененоПользователем = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		СформироватьАвтоНаименованиеНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПремийПриИзменении(Элемент)
	
	УстановитьВалютуНачисления();
	
	ОбновитьНаименование();
	
	ИзменитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРасчетаПремийПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура СегментНоменклатурыПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаРасчетаПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
	ИзменитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловияНачисленияПремий

&НаКлиенте
Процедура УсловияНачисленияПремийПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Комментарий.КнопкаВыбора = Истина;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияМобильныйКлиент()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КолонкаЛево.РастягиватьПоГоризонтали = Истина;
	Элементы.КолонкаПраво.РастягиватьПоГоризонтали = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьЭлементов()
	
	ИмяСвойстваВидимость = "Видимость";
	Если Объект.СпособРасчетаПремий = Перечисления.СпособыРасчетаПремийПоЛичнымПродажам.Сумма Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаВалюта", ИмяСвойстваВидимость, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПорядокОкругления", ИмяСвойстваВидимость, Ложь);
	КонецЕсли;
	
	Если Объект.СпособРасчетаПремий = Перечисления.СпособыРасчетаПремийПоЛичнымПродажам.Процент Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаВалюта", ИмяСвойстваВидимость, Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПорядокОкругления", ИмяСвойстваВидимость, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТекстПодсказок()
	
	ПараметрыРасширение = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыРасширение.ТипСообщения = "Информация";
	ПараметрыРасширение.Скрываемый = Ложь;
	ПараметрыРасширение.Сообщение
		= НСтр("ru = 'Правило применится, если будут выполнены все условия за период регистрации документа ""Начисление зарплаты""'");
	ПараметрыРасширение.КраткоеПредставление = НСтр("ru = 'Условия применения правила'");
	ОбщегоНазначения.ВставитьВажноеСообщение(ЭтотОбъект, ПараметрыРасширение, Элементы.ГруппаУсловия,
		Элементы.УсловияНачисленияПремий);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
КонецПроцедуры

// Формирует параметры автонаименования для правила расчета премий по личным продажам.
//
// Параметры:
//   ПравилаРасчетаОбъект - Структура - объект правила расчета премий
//
// Возвращаемое значение:
//   Структура - параметры автонаименования
&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыАвтонаименования(Знач ПравилаРасчетаОбъект)
	
	ПараметрыАвтонаименования = Новый Структура;
	ПараметрыАвтонаименования.Вставить("СпособРасчетаПремий", ПравилаРасчетаОбъект.СпособРасчетаПремий);
	ПараметрыАвтонаименования.Вставить("СегментНоменклатуры", ПравилаРасчетаОбъект.СегментНоменклатуры);
	ПараметрыАвтонаименования.Вставить("Значение", ПравилаРасчетаОбъект.ЗначениеРасчетаПремий);
	ПараметрыАвтонаименования.Вставить("Валюта", ПравилаРасчетаОбъект.ВалютаРасчета);

	ПараметрыАвтонаименования.Вставить("УсловияНачисленияПремий", "");
	ШаблонЕстьУсловие = "(%1)";
	КоличествоУсловий = ПравилаРасчетаОбъект.УсловияНачисленияПремий.Количество();
	Если КоличествоУсловий = 1 Тогда
		ПараметрыАвтонаименования.УсловияНачисленияПремий = СтрШаблон(ШаблонЕстьУсловие, 
			ПравилаРасчетаОбъект.УсловияНачисленияПремий[0].УсловиеНачисления);
	КонецЕсли;
	Если КоличествоУсловий > 1 Тогда
		ПараметрыАвтонаименования.УсловияНачисленияПремий = СтрШаблон(ШаблонЕстьУсловие, 
			НСтр("ru = 'несколько условий'"));
	КонецЕсли;
	
	Возврат ПараметрыАвтонаименования;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СписокАвтоНаименований(ПараметрыАвтонаименования)
	
	СписокНаименований = Новый СписокЗначений;
	
	СтрокаНаименования = "";
	
	Сегмент = ?(ЗначениеЗаполнено(ПараметрыАвтонаименования.СегментНоменклатуры),
		СтрШаблон(НСтр("ru = 'номенклатуры сегмента %1'"), ПараметрыАвтонаименования.СегментНоменклатуры), "");
	
	Если ПараметрыАвтонаименования.СпособРасчетаПремий
		= ПредопределенноеЗначение("Перечисление.СпособыРасчетаПремийПоЛичнымПродажам.Процент") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Премия %1%% от продаж %2'"),
			ПараметрыАвтонаименования.Значение, Сегмент);
	КонецЕсли;
	
	Если ПараметрыАвтонаименования.СпособРасчетаПремий
		= ПредопределенноеЗначение("Перечисление.СпособыРасчетаПремийПоЛичнымПродажам.Сумма") Тогда
		СтрокаНаименования = СтрШаблон(НСтр("ru = 'Фиксированная премия %1 %2 за продажи %3'"),
			ПараметрыАвтонаименования.Значение, ПараметрыАвтонаименования.Валюта, Сегмент);
	КонецЕсли;
	
	СписокНаименований.Добавить(СтрокаНаименования);
	
	Если ПустаяСтрока(ПараметрыАвтонаименования.УсловияНачисленияПремий) Тогда
		СтрокаНаименования = СтрокаНаименования + НСтр("ru = 'без условий'");
	Иначе
		СтрокаНаименования = СтрокаНаименования + ПараметрыАвтонаименования.УсловияНачисленияПремий;
	КонецЕсли;
	СписокНаименований.Добавить(СтрокаНаименования);
	
	Возврат СписокНаименований;
	
КонецФункции

&НаКлиенте
Функция СформироватьАвтоНаименованиеНаКлиенте()
	
	ПараметрыОбъекта = ПараметрыАвтонаименования(Объект);
	ВозможныеНаименования = СписокАвтоНаименований(ПараметрыОбъекта);

	Элементы.Наименование.СписокВыбора.Очистить();
	Элементы.Наименование.СписокВыбора.ЗагрузитьЗначения(ВозможныеНаименования.ВыгрузитьЗначения());
		
	СтрокаНаименования = "";
	Если ВозможныеНаименования.Количество() > 0 Тогда
		СтрокаНаименования = ВозможныеНаименования[ВозможныеНаименования.Количество() - 1];
	КонецЕсли;
	
	Возврат СтрокаНаименования;
		
КонецФункции

&НаСервере
Функция СформироватьАвтоНаименованиеНаСервере()
	
	ПараметрыОбъекта = ПараметрыАвтонаименования(Объект);
	ВозможныеНаименования = СписокАвтоНаименований(ПараметрыОбъекта);

	Элементы.Наименование.СписокВыбора.Очистить();
	Элементы.Наименование.СписокВыбора.ЗагрузитьЗначения(ВозможныеНаименования.ВыгрузитьЗначения());
		
	СтрокаНаименования = "";
	Если ВозможныеНаименования.Количество() > 0 Тогда
		СтрокаНаименования = ВозможныеНаименования[ВозможныеНаименования.Количество() - 1];
	КонецЕсли;
	
	Возврат СтрокаНаименования;
		
КонецФункции

&НаКлиенте
Процедура ОбновитьНаименование()

	Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();

КонецПроцедуры

&НаСервере
Процедура УстановитьВалютуНачисления()
	
	Если Объект.СпособРасчетаПремий = Перечисления.СпособыРасчетаПремийПоЛичнымПродажам.Процент Тогда
		
		Объект.ВалютаРасчета = Константы.ВалютаУчета.Получить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
